{"בדיקה": "https://aidg.co.il/", "יוסי בניון": "Yossi Shai Benayoun (Hebrew: יוסי שי בניון; born 5 May 1980) is an Israeli former professional footballer who played as a midfielder. He spent most of his career in Israel and England and captained the Israel national team. Born in Dimona, he is sometimes nicknamed \"The Diamond from Dimona\" in Israel. As of 2023, he has been the sporting director of the Israel national team.Benayoun played for Hapoel Be'er Sheva and Maccabi Haifa before moving to Racing de Santander in Spain. Three years later he moved to the Premier League with West Ham United, and later Liverpool. In 2010, he signed for Chelsea, where he was used rarely, being loaned to Arsenal and back to West Ham, but nonetheless won the 2012–13 UEFA Europa League. After that, he was released by the club and spent a season in the Football League Championship with Queens Park Rangers before returning to Maccabi Haifa.\nA full international for twenty years from 1998 to 2018, Benayoun is Israel's most capped player of all time with 102 caps, and their joint third top scorer with 24 international goals.\nBenayoun holds the position of sporting director for Beitar Jerusalem the club that he last played for.", "יצחק שום": "יצחק שום (נולד ב-1 בספטמבר 1948) הוא כדורגלן עבר ומאמן ישראלי, וכיום הבעלים של הפועל כפר סבא. שום שיחק בעמדת הקשר, ולזכותו עשרה שערים ב-78 הופעות במדי נבחרת ישראל.", "ישראל": "יִשְׂרָאֵל היא מדינה במזרח התיכון, במערב יבשת אסיה, השוכנת על החוף הדרום־מזרחי של הים התיכון. ישראל הוקמה בשטחי ארץ ישראל, ביתו הלאומי וארץ מולדתו של העם היהודי. המדינה הכריזה על עצמאותה בה' באייר תש\"ח, 14 במאי 1948, והיא בעלת משטר מסוג דמוקרטיה פרלמנטרית.\n\nשטחה של המדינה הוא 22,072 קמ\"ר (כולל מזרח ירושלים ורמת הגולן עליהן הכריזה ריבונות, ללא אזור יהודה ושומרון ורצועת עזה). אוכלוסייתה מנתה בשנת 2023, על־פי נתוני הלשכה המרכזית לסטטיסטיקה, 9,716,600 תושבים. מבחינה דמוגרפית, רוב הישראלים הם יהודים (73.5%), אך יש בה מיעוט ערבי גדול (כ־21%, מרביתו מוסלמי) וקבוצות מיעוט אחרות (5.5%). ישראל גובלת בים התיכון ובמצרים במערב, בים האדום בדרום, בירדן במזרח, בסוריה בצפון־מזרח ובלבנון בצפון. בין ישראל ומצרים, לחוף הים התיכון, נמצאת רצועת עזה, שבשליטת חמאס. באזור ההר המרכזי והבקעה שבין ישראל לירדן נמצאים שטחי יהודה ושומרון, המוחזקים בידי ישראל תחת תפיסה לוחמתית.\nבמהלך המאה ה־19 חלה התעוררות לאומית בקרב יהודי אירופה שהביאה להקמת התנועה הציונית ולגלי עלייה לארץ ישראל. ב־1917, במהלך מלחמת העולם הראשונה, כבשה האימפריה הבריטית את ארץ ישראל מידי העות'מאנים ופורסמה הצהרת בלפור. בתקופת המנדט הבריטי מאבקים ממושכים בין היישוב היהודי וערביי ארץ ישראל הביאו את בריטניה למסור את שאלת המנדט בארץ לאו\"ם, שהמליץ ב־1947 לחלק את ארץ ישראל לשתי מדינות, יהודית וערבית. התוכנית התקבלה על ידי הסוכנות היהודית, אך נדחתה בידי ההנהגה הערבית; עימות צבאי שניצת בין הצדדים התפתח למלחמת העצמאות, שבמהלכה הוכרזה הקמתה של מדינת ישראל. בתום המלחמה והסכמי שביתת הנשק, שלטה ישראל במרבית שטח המנדט לשעבר, אף מעבר למה שהוקצה למדינה היהודית בתוכנית החלוקה. יהודה ושומרון ורצועת עזה נכבשו על ידי ירדן ומצרים, בהתאמה. המדינה הערבית לא הוקמה, ומאות אלפי ערבים־פלסטינים נסו או גורשו מבתיהם במסגרת הנכבה. במקביל עלו לישראל מאות אלפי פליטים יהודים ממדינות ערב.\nב־1967, במלחמת ששת הימים, כבשה ישראל את יהודה ושומרון, רצועת עזה וחצי האי סיני ואת רמת הגולן. מלבד סיני, שהחזירה ישראל למצרים במסגרת הסכם השלום ביניהן, ורצועת עזה, שממנה נסוגה באופן חד־צדדי ב-2005, המשיכה ישראל לשלוט בשאר השטחים האמורים. חוקי המדינה הוחלו במלואם על מזרח ירושלים ורמת הגולן, ובאופן חלקי על יהודה ושומרון. בעקבות הסכמי אוסלו, ניתנה אוטונומיה חלקית לרשות הפלסטינית בכ־40% משטחי יהודה ושומרון ובעבר גם על רוב שטח רצועת עזה. מאמצים לפתור את הסכסוך הישראלי־פלסטיני לא הבשילו לכדי הסכם שלום סופי; ברם, נחתמו הסכמי שלום ונורמליזציה אחרים בין ישראל למדינות ערביות.על פי החוק הישראלי, בירת ישראל היא ירושלים. למדינות רבות יש הסתייגויות לגבי מעמדה של ירושלים כבירת ישראל, ועל כן רוב השגרירויות הזרות בישראל נמצאות בגוש דן ובפרט בתל אביב, המרכז הכלכלי והטכנולוגי של המדינה.\nבחוקי היסוד שלה מוגדרת ישראל כ\"מדינה יהודית ודמוקרטית\". ישראל היא דמוקרטיה ייצוגית, עם מערכת פרלמנטרית, ייצוג בשיטה היחסית וזכות בחירה אוניברסלית. ראש הממשלה הוא ראש הרשות המבצעת והכנסת היא הרשות המחוקקת. ישראל היא מדינה מפותחת וחברה בארגון לשיתוף פעולה ולפיתוח כלכלי (OECD). כלכלת המדינה דורגה ב־2022 במקום ה־29 בעולם, על פי תוצר מקומי גולמי נומינלי, כלכלתה בין המפותחות והמתקדמות בעולם. לישראל כוח עבודה מיומן, והיא אחת המדינות המשכילות בעולם, על פי אחוז אזרחיה בעלי תואר דוקטור. רמת החיים בישראל היא הגבוהה ביותר במזרח התיכון, ובמדד הפיתוח האנושי של האומות המאוחדות היא מדורגת במקום ה-19, תוחלת החיים בה היא אחת הגבוהות בעולם.", "תודה": "The thank offering (Hebrew: תֹּודָה, pronounced Todah) or sacrifice of thanksgiving (Hebrew zevakh hatodah זֶבַח הַתֹּודָה ) was an optional offering under the Law of Moses. This is also termed the \"thanksgiving offering.\"\nIf he offer it for a thanksgiving, then he shall offer with the sacrifice of thanksgiving unleavened cakes mingled with oil, and unleavened wafers anointed with oil, and cakes mingled with oil, of fine flour, fried. \nThe Hebrew noun todah \"thanksgiving\" is derived from the Hiphil of the verb yadah (יָדָה) \"to praise.\"\n\nCommonly used as \"Thank You\" usually followed by bevakasha \"You're Welcome\"\n\n", "אור": "\"Let there be light\" is an English translation of the Hebrew יְהִי אוֹר‎ (yehi 'or) found in Genesis 1:3 of the Torah, the first part of the Hebrew Bible.  In Old Testament translations of the phrase, translations include the Greek phrase γενηθήτω φῶς (genēthḗtō phôs) and the Latin phrases fiat lux and lux sit.", "אוהד": "Ohad Naharin  (born 1952) (Hebrew: אוהד נהרין) is an Israeli choreographer, contemporary dancer, and creator and teacher of a unique system/language/pedagogy of dance called Gaga. He served as artistic director of Batsheva Dance Company from 1990; he stepped down in 2018.", "תמר": "https://he.wikipedia.org/wiki/%D7%AA%D7%9E%D7%A8_%D7%9E%D7%A6%D7%95%D7%99", "צ'רון שרי": "This is a list of Israeli football transfers for the 2019 Summer Transfer Window.\n\n", "cherry": "A berry is a small, pulpy, and often edible fruit. Typically, berries are juicy, rounded, brightly colored, sweet, sour or tart, and do not have a stone or pit, although many pips or seeds may be present. Common examples of berries in the culinary sense are strawberries, raspberries, blueberries, blackberries, red currants, white currants and blackcurrants. In Britain, soft fruit is a horticultural term for such fruits.In common usage, the term \"berry\" differs from the scientific or botanical definition of a fruit produced from the ovary of a single flower in which the outer layer of the ovary wall develops into an edible fleshy portion (pericarp). The botanical definition includes many fruits that are not commonly known or referred to as berries, such as grapes, tomatoes, cucumbers, eggplants, bananas, and chili peppers. Fruits commonly considered berries but excluded by the botanical definition include strawberries, raspberries, and blackberries, which are aggregate fruits and mulberries, which are multiple fruits. Watermelons and pumpkins are giant berries that fall into the category \"pepos\". A plant bearing berries is said to be bacciferous or baccate.\nBerries are eaten worldwide and often used in jams, preserves, cakes, or pies. Some berries are commercially important. The berry industry varies from country to country as do types of berries cultivated or growing in the wild. Some berries such as raspberries and strawberries have been bred for hundreds of years and are distinct from their wild counterparts, while other berries, such as lingonberries and cloudberries, grow almost exclusively in the wild.\nWhile many berries are edible, some are poisonous to humans, such as deadly nightshade and pokeweed. Others, such as the white mulberry, red mulberry, and elderberry, are poisonous when unripe, but are edible when ripe.", "ברק בכר": "ברק בכר (נולד ב-21 בספטמבר 1979) הוא כדורגלן עבר ומאמן כדורגל ישראלי, המאמן את הכוכב האדום בלגרד. כמאמן ראשי, הוביל את עירוני קריית שמונה לזכייה בגביע המדינה ב-2014. אחר כך, הוביל את הפועל באר שבע לשלוש אליפויות רצופות וכך עשה גם במכבי חיפה, שבהנהגתו אף העפילה ב-2022 לשלב הבתים של ליגת האלופות. בכר נחשב לאחד מהמאמנים הישראלים הטובים בכל הזמנים.", "ג'ון קולמה": "https://www.hamichlol.org.il/%D7%92%27%D7%95%D7%9F_%D7%A7%D7%95%D7%9C%D7%9E%D7%94", "אוהד שירזי": "https://www.youtube.com/channel/UCljehs2AflQrcJ8zN0F-LAw", "הענק הירוק": "https://vod.walla.co.il/movie/1873797", "נענע": "Nana 10 (Hebrew: נענע 10), previously Nana (lit. mint), was an Israeli Web portal. The website was owned by Israeli web and communication company 013 Netvision, and Israeli news Channel 10, and consisted of Internet forums, which it was especially known for, news, culture sections, an Internet magazine and more. The site was closed after the channel's move to their new website, 10.TV.", "elyaniv barda": "Elyaniv Barda (or Elianiv, Hebrew: אליניב ברדה; born 15 December 1981) is an Israeli former football forward and winger, And the current manager of Hapoel Be'er Sheva. His former clubs include Hapoel Be'er Sheva, Maccabi Haifa, Hapoel Tel Aviv and Belgian side Racing Genk, with whom he won four trophies during a successful six-year spell. Bards is considered by many to be Hapoel Be’er Sheva’s biggest player of all time.\n\n", "דמוקרטיה": "Defensive democracy is a term referring to the collection of laws, delegated legislation, and court rulings which limit certain rights and freedoms in a democratic society in order to protect the existence of the state, its democratic character and institutions, minority rights, et cetera. The term describes a major conflict that may emerge in a democratic country between compliance with democratic values, particularly freedom of association and the right to be elected, and between preventing anti-democratic groups and persons from abusing these principles.\nIn certain democratic states there are additional special distinctions, supported by a notable section of the population, which justify the use of defensive democracy. However, the question of in what situations the use of defensive democracy is justified without this being considered excessive repression of civil rights is disputed.\n\n", "בלאגן": "Hakol Ze Letova (Hebrew: הכל זה לטובה, It Is All For The Best) is the eighth and latest studio album by Israeli singer Dana International, released on 15 August 2007 by Hed Arzi label with the catalogue number 64726.", "גולני": "Wissam Assimi (Arabic: ويسام عيسمي, Hebrew: ויסאם עיסמי; born 12 July 1976) is a retired Israeli footballer who now works as a manager.", "חטיבת גולני": "The 1st \"Golani\" Brigade (Hebrew: חֲטִיבַת גּוֹלָנִי) is an Israeli military infantry brigade that is subordinated to the 36th Division and traditionally associated with the Northern Command. It is one of the five infantry brigades of the regular Israel Defense Forces (IDF), the others being the Paratroopers Brigade, the Nahal Brigade, the Givati Brigade and the Kfir Brigade. Its symbol is a green olive tree against a yellow background, with its soldiers wearing a brown beret. It is one of the most highly decorated infantry units in the IDF. The brigade consists of five battalions, including two which it kept from its inception (12th and 13th), one transferred from the Givati Brigade (51st).\nThe brigade was formed on February 22, 1948, during the 1948 Arab–Israeli War, when the Levanoni Brigade in the Galilee split into the 1st Golani Brigade and the 2nd Carmeli Brigade. It has since participated in all of Israel's major wars and nearly all major operations, including the Suez Crisis, the Six-Day War, the War of Attrition, the Yom Kippur War, Operation Entebbe, the 1978 South Lebanon conflict, the 1982 and 2006 Lebanon Wars, and various operations during the Palestinian intifadas.\nThree of its commanders, Mordechai Gur, Gabi Ashkenazi and Gadi Eizenkot have become IDF Chiefs of Staff with many more reaching the rank of aluf (major general).\n\n", "צה''ל": "The Israel Defense Forces (IDF; Hebrew: צְבָא הַהֲגָנָה לְיִשְׂרָאֵל Tsva ha-Hagana le-Yisra'el, lit. 'The Army of Defense for Israel'), alternatively referred to by the Hebrew-language acronym Tzahal (צה״ל), is the national military of the State of Israel. It consists of three service branches: the Israeli Ground Forces, the Israeli Air Force, and the Israeli Navy. It is the sole military wing of the Israeli security apparatus. The IDF is headed by the Chief of the General Staff, who is subordinate to the Israeli Defense Minister.\nOn the orders of David Ben-Gurion, the IDF was formed on 26 May 1948 and began to operate as a conscript military, drawing its initial recruits from the already-existing paramilitaries of the Yishuv—namely Haganah, the Irgun, and Lehi. Since its formation shortly after the Israeli Declaration of Independence, the IDF has participated in every armed conflict involving Israel. While it originally operated on three major fronts—against Lebanon and Syria in the north, against Jordan and Iraq in the east, and against Egypt in the south—the IDF has primarily shifted its focus to southern Lebanon and the Palestinian Territories since the 1979 Egypt–Israel peace treaty and 1994 Israel–Jordan peace treaty. However, notable Israeli–Syrian border incidents have occurred frequently since 2011 due to regional instability caused by the ongoing multi-sided Syrian Civil War.\nThe IDF is unique among the militaries of the world due to its regulated conscription of women since its formation. It is one of the most prominent institutions in Israeli society due to its influence on the country's economy and political scene. It uses several technologies developed within Israel, with many of them made specifically to cater to its needs in its operational environment in the Levant. Prominent Israeli-developed military equipment includes: the Merkava, a main battle tank; the Achzarit and Namer - armored personnel carriers; Iron Dome, an air defense system; Trophy, an active protection system; IDF Caterpillar D9 armored bulldozer; Spike anti-tank guided missile family; MATADOR shoulder-launched rocket; the IMI Galil and IWI Tavor families of assault rifles; and the Uzi, a family of submachine guns. Since 1967, the IDF has had a close security relationship with the United States, including in research and development cooperation, with joint efforts on the F-15I, the Tactical High-Energy Laser, and the Arrow, among others.\nThe IDF is believed to have maintained an operational nuclear weapons capability since 1967, possibly possessing between 80 and 400 nuclear warheads; its nuclear-delivery system structure is widely suspected of having been successfully developed into a nuclear triad, primarily consisting of Jericho land-based intercontinental ballistic missiles, Popeye Turbo maritime-based submarine-launched cruise missiles, and various delivery-capable aircraft.", "java": "ג'אווה (באנגלית: Java) היא שפת תכנות מונחית עצמים אשר פותחה בחברת סאן מיקרוסיסטמס (כיום חברת־בת של אורקל) על ידי צוות בראשות ג'יימס גוסלינג בשנת 1991, והיא אחת משפות התכנות הנפוצות ביותר הנמצאות בשימוש כיום. השפה הוצגה לראשונה בשנת 1995, והיא מהווה את אחד מרכיבי הליבה של פלטפורמת התוכנה ג'אווה.\nהתחביר של השפה מבוסס במידה רבה על התחביר של ++C, אך כולל הרחבות רבות במטרה לאפשר תמיכה מובנית בתהליכונים, בינלאומיות, אבטחה ועבודה בסביבת האינטרנט ותכונות נוספות.\nלרוב עוברות תוכניות ג'אווה הידור ל־Java bytecode, שפת ביניים דמוית שפת מכונה, שאותה מריצה מכונה וירטואלית (Java Virtual Machine; JVM). הודות לכך התוכנית יכולה לרוץ על כל מחשב ועל כל מערכת הפעלה המריצים JVM, החל מטלפונים סלולריים ועד למחשבי-על.\nבשנת 1996 הוקם לראשונה הכנס \"JavaOne\", כנס שנתי המאגד אלפי משתמשי ומפתחי השפה הדנים בפיתוחה ובעדכונים הטכנולוגיים בה.\nנכון ליולי 2022, ג'אווה נחשבת לשפת התכנות השנייה ברמת הפופולריות בעולם, גם בקרב מהנדסי תוכנה מקצועיים וגם על פי מדידת Google Trends.", "python": "פיית'ון (באנגלית: Python) היא שפת תכנות עילית דינמית למטרות כלליות מהנפוצות ביותר. פיית׳ון תוכננה תוך שימת דגש על קריאוּת הקוד, וכוללת מבנים המיועדים לאפשר ביטוי של תוכניות מורכבות בדרך קצרה וברורה. אחד המאפיינים הבולטים בתחביר השפה הוא השימוש בהזחה להגדרת בלוקים של קוד (ללא שימוש בסוגריים או במילים שמורות לצורך כך, כמו ברוב השפות הנפוצות).\nפיית׳ון היא שפה מרובת־פרדיגמות, המאפשרת תכנות מונחה־עצמים, תכנות פרוצדורלי, ובמידה מסוימת גם תכנות פונקציונלי. לשפה ספרייה סטנדרטית גדולה וענפה, והיא תומכת באופן מובנה בהרחבה שלה אל שפות אחרות (בתלות במפרש: C‏, ++C,‏ Java‏ ו־#C).\nלשפה שתי גרסאות ראשיות, פיית׳ון 2 ופיית׳ון 3. פיית׳ון 2 איננה בפיתוח יותר, והתמיכה בה הסתיימה בשנת 2020.\nפיית׳ון מדורגת באופן עקבי כאחת משפות התכנות הפופולריות ביותר.", "code": "https://code.org/", "programming": "Computer programming is the process of performing particular computations (or more generally, accomplishing specific computing results), usually by designing and building executable computer programs. Programming involves tasks such as analysis, generating algorithms, profiling algorithms' accuracy and resource consumption, and the implementation of algorithms (usually in a particular programming language, commonly referred to as coding). The source code of a program is written in one or more languages that are intelligible to programmers, rather than machine code, which is directly executed by the central processing unit. The purpose of programming is to find a sequence of instructions that will automate the performance of a task (which can be as complex as an operating system) on a computer, often for solving a given problem. Proficient programming thus usually requires expertise in several different subjects, including knowledge of the application domain, specialized algorithms, and formal logic.\nTasks accompanying and related to programming include testing, debugging, source code maintenance, implementation of build systems, and management of derived artifacts, such as the machine code of computer programs. However, while these might be considered part of the programming process, often the term software development is more likely used for this larger overall process – whereas the terms programming, implementation, and coding tend to be focused on the actual writing of code. Relatedly, software engineering combines engineering techniques and principles with software development. Also, those involved with software development may at times engage in reverse engineering, which is the practice of seeking to understand an existing program so as to re-implement its function in some way.\n\n"}